# Brewfile for GUI Applications
# This file manages GUI applications (casks) and essential system tools.
# CLI development tools are managed by devbox (see devbox.json).
#
# Usage:
#   brew bundle install          # Install all packages
#   brew bundle cleanup --force  # Remove packages not in this file
#   brew bundle check            # Check if all packages are installed

# ============================================================================
# Formulae (CLI Tools)
# ============================================================================

# App Store CLI: install Mac App Store apps from terminal
# Note: mas is macOS-specific and requires deep system integration with the Mac App Store
brew "mas"

# ============================================================================
# Casks (GUI Applications)
# ============================================================================

# === Browsers ===
# Firefox: privacy-focused browser, great dev tools
cask "firefox"
# Zen: minimalist browser
cask "zen@twilight"
# Chrome: good for testing
cask "google-chrome"

# === Development tools ===
# JetBrains Toolbox: manage JetBrains IDEs
cask "jetbrains-toolbox"
# VS Code: powerful code editor with extensions
cask "visual-studio-code"
# Modern terminal: AI-powered terminal with modern UI
cask "warp"
# Fast Docker: faster Docker alternative for Mac, replaces Docker Desktop
cask "orbstack"
# API test: test REST APIs with GUI
cask "postman"
# k8s IDE: visual Kubernetes management
cask "lens"

# === Productivity and utilities ===
# Passwords: secure password manager
cask "1password"
# Launcher: Spotlight replacement with plugins
cask "raycast"
# Share input: share keyboard/mouse across computers
cask "barrier"
# Clipboard manager: modern, lightweight clipboard history
cask "maccy"

# === Media and entertainment ===
# Audio player: advanced audio player
cask "foobar2000"
# Audio edit: record/edit audio
cask "audacity"
# Music tag: auto-tag music files
cask "musicbrainz-picard"
# Gaming: PC game platform
cask "steam"
# Epic Games: play Epic/GOG games
cask "heroic"

# === Communication ===
# Team chat: workplace communication
cask "slack"

# === System tools and utilities ===
# Mac maintenance: clean/optimize macOS
cask "onyx"
# Uninstaller: completely remove apps
cask "appcleaner"
# Archives: extract AND create archives with GUI, handles formats macOS can't (RAR, 7z, etc.)
cask "keka"
# Gestures: advanced trackpad/mouse gesture control
cask "jitouch"

# === Remote access ===
# Remote desktop: remote computer access
cask "teamviewer"

# === Backup and sync ===
# rsync GUI: visual rsync file sync
cask "rsyncui"
# Torrent: lightweight BitTorrent client
cask "transmission"